<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.charlesmisson.charlesmisson-recipes.munki.AdoptOpenJDK12</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/AdoptOpenJDK/12/</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>production</string>
			</array>
            <key>description</key>
            <string>AdoptOpenJDK 12 HotSpot</string>
			<key>category</key>
			<string>Developer Tools</string>
			<key>developer</key>
			<string>AdoptOpenJDK</string>
			<key>name</key>
			<string>AdoptOpenJDK 12</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
			<key>uninstall_method</key>
			<string>removepackages</string>			
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.charlesmisson.recipes.download.AdoptOpenJDK12_Signed</string>
    <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: London Jamocha Community CIC (VDX7B37674)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
			    <string>MunkiImporter</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
				    <string>%pathname%</string>
				    <key>repo_subdirectory</key>
				    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
            </dict>
        </array>
</dict>
</plist>